using PyPlot

a = [ 0.5  -1.0   0.25
      1.0   0.5  -1.0 ]

function points(λ)
    x = zeros(2,3)
    x[:,1] .= (1-2λ) * a[:,1] +      λ * a[:,2] +      λ * a[:,3]
    x[:,2] .=      λ * a[:,1] + (1-2λ) * a[:,2] +      λ * a[:,3]
    x[:,3] .=      λ * a[:,1] +      λ * a[:,2] + (1-2λ) * a[:,3]
    m = zeros(2,3)
    m[:,1] = 0.5 * a[:,3] + 0.5 * a[:,2]
    m[:,2] = 0.5 * a[:,1] + 0.5 * a[:,3]
    m[:,3] = 0.5 * a[:,2] + 0.5 * a[:,1]
    return x, m
end


figure(1)
J = [1, 2, 3, 1]
plot(a[1,J], a[2,J], "-k")
x, m = points(1/6)
for j = 1:3
    plot([a[1,1], m[1,1]], [a[2,1], m[2,1]], "--k")
end
plot(x[1,:], x[2,:], "or")

axis("equal")
axis("off")
